In [2]:
import pandas as pd

In [3]:
path = '/Users/krishna/Documents/School/GeorgiaTech/HW/HW4/Instructions/HeroesOfPymoli/Resources/purchase_data.csv'
data = pd.read_csv(path)

PLAYER COUNT

In [4]:
player_count = data['SN'].nunique()

In [5]:
data.head(2)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56

PURCHASING ANALYSIS

In [6]:
unique_items = data['Item ID'].nunique()
unique_items

183

In [7]:
avg_price = data['Price'].mean()
avg_price

3.050987179487176

In [8]:
num_of_purchase = data['Purchase ID'].count()
num_of_purchase

780

In [9]:
revenue = data['Price'].sum()
revenue

2379.77

Gender Demographics

In [10]:
purchase_data = data.drop_duplicates(subset = 'SN',inplace = False).sort_values(by = ['SN']).reset_index()[['SN','Gender','Age']]
purchase_data.head()

             SN  Gender  Age
0  Adairialis76    Male   16
1   Adastirin33  Female   35
2        Aeda94    Male   17
3        Aela59    Male   21
4     Aelaria33    Male   23

In [11]:
count_person = data.groupby('SN').count()[['Age']]
count_person =  count_person.rename(columns = {'Age': "Count"} )
count_person.head()

              Count
SN
Adairialis76      1
Adastirin33       1
Aeda94            1
Aela59            1
Aelaria33         1

In [12]:
price_person = data.groupby('SN').sum()[['Price']]

In [13]:
gender_df = pd.DataFrame(columns = ['SN', 'Gender', 'Age'])
gender_df[['SN', 'Gender', 'Age']]= purchase_data
#gender_df['Count'] = count_person
#gender_df['Price'] = price_person
gender_df = gender_df.merge(count_person, 'left', on = 'SN')
gender_df = gender_df.merge(price_person, 'left', on = 'SN')
gender_df.head()

             SN  Gender  Age  Count  Price
0  Adairialis76    Male   16      1   2.28
1   Adastirin33  Female   35      1   4.48
2        Aeda94    Male   17      1   4.91
3        Aela59    Male   21      1   4.32
4     Aelaria33    Male   23      1   1.79

In [14]:
gender_count = gender_df.groupby("Gender").count()[['Count']]

In [15]:
total_players = gender_count.loc['Female','Count']+ gender_count.loc['Male','Count']+ gender_count.loc['Other / Non-Disclosed','Count']
total_players = int(total_players)

In [16]:
total_count = pd.DataFrame([{'Total' , total_players}])
total_count = total_count.set_index(1)
total_count = total_count.rename(columns = {0 : 'Count'} )
total_count

       Count
1
Total    576

In [17]:
gender_count = gender_count.append(total_count)
gender_count.index.name = 'Gender'
gender_count

                       Count
Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Total                    576

In [18]:
female_percentage = gender_count.loc['Female', 'Count']/gender_count.loc['Total','Count']
male_percentage = gender_count.iloc[1,0]/gender_count.iloc[3,0]
other_percentage = gender_count.iloc[2,0]/gender_count.iloc[3,0]
print()
female_percentage = float(female_percentage)
male_percentage = float(male_percentage)
other_percentage = float(other_percentage)

In [19]:
gender_percentage = pd.DataFrame([{'Female', female_percentage}, {'Male', male_percentage}, {"Other / Non-Disclosed", other_percentage}, {'Total', (female_percentage+male_percentage+other_percentage)}])
gender_percentage = gender_percentage.rename(columns = {1 : 'Gender'})
gender_percentage = gender_percentage.set_index('Gender')
gender_percentage = gender_percentage.rename(columns = {0 : 'Percentage'})
gender_percentage

                       Percentage
Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
Total                    1.000000

In [20]:
gender_demographics_df = gender_count.merge(gender_percentage, 'left', on = "Gender")
gender_demographics_df

                       Count  Percentage
Gender
Female                    81    0.140625
Male                     484    0.840278
Other / Non-Disclosed     11    0.019097
Total                    576    1.000000

Purchasing Analysis (Gender)

In [21]:
purchase_count_gender = data.groupby('Gender').count() ['Age']
purchase_count_gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Age, dtype: int64

In [22]:
purchase_mean_gender = data.groupby('Gender').mean()['Price']
purchase_mean_gender

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [23]:
purchase_sum_gender = data.groupby("Gender").sum()['Price']
purchase_sum_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [24]:
male_purchase_total_perperson = data[data['Gender']=='Male'].groupby('SN').mean().head()[['Price']]
male_purchase_total_perperson

              Price
SN
Adairialis76  2.280
Aeda94        4.910
Aela59        4.320
Aelaria33     1.790
Aelastirin39  3.645

In [25]:
female_purchase_total = data[data['Gender']=='Female'].groupby('SN').mean()[['Price']]
female_purchase_total.head()

               Price
SN
Adastirin33     4.48
Aerithllora36   4.32
Aethedru70      3.54
Aidain51        3.45
Aiduesu86       4.48

In [26]:
other_purchase_total = data[data['Gender']=='Other / Non-Disclosed'].groupby('SN').mean()[['Price']]
other_purchase_total.head()

             Price
SN
Airi27        3.45
Chanosian48   3.76
Eodaisu60     3.94
Haerithp41    4.40
Idairin51     3.50

AGE DEMOGRAPHICS

In [27]:
purchase_data.head()

             SN  Gender  Age
0  Adairialis76    Male   16
1   Adastirin33  Female   35
2        Aeda94    Male   17
3        Aela59    Male   21
4     Aelaria33    Male   23

In [28]:
bins = [0,13,19,100]
lable = ['Kid', 'Teenager', 'Adult']
age = pd.cut(gender_df['Age'], bins, labels=lable)
gender_df['Age_Group'] = age
data['Age_Group'] = age

In [29]:
gender_df = gender_df.drop(columns= "Count")
gender_df.head()

             SN  Gender  Age  Price Age_Group
0  Adairialis76    Male   16   2.28  Teenager
1   Adastirin33  Female   35   4.48     Adult
2        Aeda94    Male   17   4.91  Teenager
3        Aela59    Male   21   4.32     Adult
4     Aelaria33    Male   23   1.79     Adult

In [30]:
purchase_count_age = gender_df.groupby('Age_Group').count()['Age']
purchase_count_age

Age_Group
Kid          37
Teenager    109
Adult       430
Name: Age, dtype: int64

In [31]:
average_price_age = gender_df.groupby('Age_Group').mean()['Price']
average_price_age

Age_Group
Kid         4.135135
Teenager    3.851376
Adult       4.202256
Name: Price, dtype: float64

In [32]:
sum_price_age = gender_df.groupby('Age_Group').sum()['Price']
sum_price_age

Age_Group
Kid          153.00
Teenager     419.80
Adult       1806.97
Name: Price, dtype: float64

In [33]:
kid_purchase_total_mean = gender_df[gender_df['Age_Group']=='Kid'].groupby('SN').mean()["Price"]
kid_purchase_total_mean.head()

SN
Aeralria27      4.09
Aillyrin83      2.89
Anallorgue57    5.70
Chadjask77      4.93
Chanossast57    4.32
Name: Price, dtype: float64

In [34]:
teenage_purchase_total_mean = gender_df[gender_df['Age_Group']=='Teenager'].groupby('SN').mean()[['Price']]
teenage_purchase_total_mean.head()

                 Price
SN
Adairialis76      2.28
Aeda94            4.91
Aerillorin70      3.33
Aerithnucal56     4.40
Aerithriaphos46   2.18

In [35]:
adult_purchase_total_mean = gender_df[gender_df['Age_Group']=='Adult'].groupby('SN').mean()
adult_purchase_total_mean.head()

              Age  Price
SN
Adastirin33    35   4.48
Aela59         21   4.32
Aelaria33      23   1.79
Aelastirin39   23   7.29
Aelidru27      22   1.09

Top Spenders

In [36]:
unique_data = gender_df

In [37]:
top_spenders = unique_data.sort_values('Price', ascending = False).head(5)[['SN']]
top_spenders

              SN
360    Lisosia93
246  Idastidru52
106   Chamjask73
275       Iral74
281  Iskadarya95

In [38]:
top_spenders = top_spenders.merge(data, 'left', on='SN')[['SN', 'Price']]
top_spenders

             SN  Price
0     Lisosia93   4.64
1     Lisosia93   3.81
2     Lisosia93   4.80
3     Lisosia93   3.19
4     Lisosia93   2.52
5   Idastidru52   4.93
6   Idastidru52   4.03
7   Idastidru52   1.60
8   Idastidru52   4.89
9    Chamjask73   4.23
10   Chamjask73   4.76
11   Chamjask73   4.84
12       Iral74   4.14
13       Iral74   3.82
14       Iral74   4.03
15       Iral74   1.63
16  Iskadarya95   4.03
17  Iskadarya95   4.90
18  Iskadarya95   4.17

In [39]:
purchase_count_spenders = top_spenders['SN'].value_counts()
purchase_count_spenders = purchase_count_spenders.reset_index()
purchase_count_spenders = purchase_count_spenders.rename(columns = {'SN':'Count' , 'index':'SN'})
purchase_count_spenders

            SN  Count
0    Lisosia93      5
1       Iral74      4
2  Idastidru52      4
3  Iskadarya95      3
4   Chamjask73      3

In [40]:
top_spender_sum = top_spenders.groupby('SN').sum()
top_spender_sum = top_spender_sum.rename(columns = {'Price': 'Sum'})
top_spender_sum

               Sum
SN
Chamjask73   13.83
Idastidru52  15.45
Iral74       13.62
Iskadarya95  13.10
Lisosia93    18.96

In [41]:
top_spender_mean = top_spenders.groupby('SN').mean()
top_spender_mean = top_spender_mean.rename(columns = {'Price':'Average'})
top_spender_mean

              Average
SN
Chamjask73   4.610000
Idastidru52  3.862500
Iral74       3.405000
Iskadarya95  4.366667
Lisosia93    3.792000

In [42]:
spenders = purchase_count_spenders.merge(top_spender_sum, 'left', on ='SN')
spenders

            SN  Count    Sum
0    Lisosia93      5  18.96
1       Iral74      4  13.62
2  Idastidru52      4  15.45
3  Iskadarya95      3  13.10
4   Chamjask73      3  13.83

In [43]:
spenders = spenders.merge(top_spender_mean, 'left', on = 'SN')
spenders = spenders.set_index('SN')
spenders

             Count    Sum   Average
SN
Lisosia93        5  18.96  3.792000
Iral74           4  13.62  3.405000
Idastidru52      4  15.45  3.862500
Iskadarya95      3  13.10  4.366667
Chamjask73       3  13.83  4.610000

Most Popular Items

In [52]:
quantity = data.groupby('Item ID').count().reset_index()
quantity = quantity[['Item ID', 'SN']].set_index('Item ID')
quantity = quantity.rename(columns = {'SN': 'Count'})
quantity = quantity.sort_values('Count', ascending = False).head()
quantity

         Count
Item ID
178         12
145          9
108          9
82           9
19           8

In [53]:
popular_df = quantity.merge(data, 'left', on = 'Item ID')[['Item ID','Item Name', 'Price']]

In [54]:
popular_df.head()

   Item ID                                     Item Name  Price
0      178  Oathbreaker, Last Hope of the Breaking Storm   4.23
1      178  Oathbreaker, Last Hope of the Breaking Storm   4.23
2      178  Oathbreaker, Last Hope of the Breaking Storm   4.23
3      178  Oathbreaker, Last Hope of the Breaking Storm   4.23
4      178  Oathbreaker, Last Hope of the Breaking Storm   4.23

In [55]:
total_purchase_popularitem = popular_df.groupby('Item ID').sum()
total_purchase_popularitem = total_purchase_popularitem.rename(columns = {'Price':"Sum"})
total_purchase_popularitem

           Sum
Item ID
19        8.16
82       44.10
108      31.77
145      41.22
178      50.76

In [56]:
item_price_popularitem = popular_df.drop_duplicates('Item ID')[['Item ID', 'Price']]

In [57]:
item_price_popularitem

    Item ID  Price
0       178   4.23
12      145   4.58
21      108   3.53
30       82   4.90
39       19   1.02

In [58]:
popular_items = popular_df.drop(columns = 'Price').drop_duplicates('Item ID')

In [59]:
popular_items = popular_items.merge(quantity,'left', on = 'Item ID')

In [60]:
popular_items = popular_items.merge(item_price_popularitem, 'left', on ='Item ID')

In [61]:
popular_items = popular_items.merge(total_purchase_popularitem, 'left', on = 'Item ID')

In [62]:
popular_items

   Item ID                                     Item Name  Count  Price    Sum
0      178  Oathbreaker, Last Hope of the Breaking Storm     12   4.23  50.76
1      145                          Fiery Glass Crusader      9   4.58  41.22
2      108     Extraction, Quickblade Of Trembling Hands      9   3.53  31.77
3       82                                       Nirvana      9   4.90  44.10
4       19                 Pursuit, Cudgel of Necromancy      8   1.02   8.16

Most Profitable Item

In [63]:
profit_item_id = data.groupby('Item ID').sum().sort_values('Price', ascending = False).head()[["Price"]]

In [64]:
profit_item_id #total purchase value

         Price
Item ID
178      50.76
82       44.10
145      41.22
92       39.04
103      34.80

In [65]:
profit_count = data.groupby('Item ID').count()[['Age']]
profit_count = profit_count.rename(columns = {'Age':'Count'})
profit_count.head()

         Count
Item ID
0            4
1            3
2            6
3            6
4            5

In [66]:
profit_value = profit_item_id.merge(profit_count, 'left', on='Item ID').rename(columns = {'Price':'Sum'})
profit_value

           Sum  Count
Item ID
178      50.76     12
82       44.10      9
145      41.22      9
92       39.04      8
103      34.80      8

In [67]:
profit_items = data[['Item ID', 'Item Name', 'Price']].merge(profit_value, 'right', on='Item ID').drop_duplicates('Item ID')
profit_items

    Item ID                                     Item Name  Price    Sum  Count
0        92                                  Final Critic   4.88  39.04      8
8        82                                       Nirvana   4.90  44.10      9
17      178  Oathbreaker, Last Hope of the Breaking Storm   4.23  50.76     12
29      145                          Fiery Glass Crusader   4.58  41.22      9
38      103                                Singed Scalpel   4.35  34.80      8

In [68]:
profit_items =profit_items.set_index('Item ID').sort_values('Sum', ascending = False)

In [69]:
profit_items

                                            Item Name  Price    Sum  Count
Item ID
178      Oathbreaker, Last Hope of the Breaking Storm   4.23  50.76     12
82                                            Nirvana   4.90  44.10      9
145                              Fiery Glass Crusader   4.58  41.22      9
92                                       Final Critic   4.88  39.04      8
103                                    Singed Scalpel   4.35  34.80      8

Trends:

1. Outbreaker has generated the most profit as well sold the most items.

2. Other / Non-Disclosed on average spend the most on an item.

3. Lisosia93 spended the most on an item.